

// !!!!!!!!!!!!!!! LESSON 3
//  перевод в стрінгу
// toFixed переводить в стрінгу
// toPrecision переводить в стрінгу с плаваючою комою
// toString переводить в стрінгу
// 245.4589.toLocaleString('uk-UA') > '245,459'  переводить в локалізовану стрінгу

//! Задача1
// // умова
// const MIN_AGE = 18
// // Ввести данні
// let userAge = parseInt(prompt('Скільки вам років?'))

// // перевірка відповідності
// if (userAge < MIN_AGE) {
//   alert('Контент для дорослих')
// }
// else {
//   document.write('Вітаємо на сайті наш порно-магнат')
// }

//! Задача2
// // Ввести данні вага вантажу
// let userPackgageWeight = parseFloat(prompt('Скільки важить посилка?'))
// // умова максимальна вага
// const MAX_WEIGHT = 12
// //розв'язок   перевірка відповідності
// if (userPackgageWeight > MAX_WEIGHT) {
//   alert('НЕ приймаємо такі важкі посилки')
// }
// else {
//   document.write('Надішлемо без проблем)')
// }

//! Задача3
// крок 0 вводимо позначення
// вік працівника
// максимальний вік
// мінімальний вік

// //крок 1  Ввести данні
// let userAge = parseInt(prompt('Скільки вам років?'))
// // умова максимальна вага
// const MAX_USER_AGE = 45
// const MIN_USER_AGE = 32

// //крок 2 розв'язок задачі
// if (MIN_USER_AGE <= userAge && userAge <= MAX_USER_AGE) {
//   alert('Ласкаво просимо до компанії')
// }
// else {
//   alert('Нажаль ви не підходите')
// }


//! Задача4
// крок 0 вводимо позначення
// перша цифра
// друга цифра

//крок 1  Ввести данні
// let numberOne = parseInt(prompt('перша цифра'))
// let numberTwo = parseInt(prompt('друга цифра'))


// //крок 2 розв'язок задачі
// if (numberOne < numberTwo) {
//   numberTwo = 0
//   alert(`Більше число тепер дорівнює ${numberTwo}, менше дорівнює ${numberOne}`)
// }
// if (numberOne > numberTwo) {
//   numberOne = 0
//   alert(`Більше число тепер дорівнює ${numberOne}, менше дорівнює ${numberTwo}`)

// }


//! Приклад 01:58:00
// Вводимо вік користувача. Якщо це дитина (до17 років), то запропонуємо купити морозиво, інакше запропонуємо пиво


// крок 0 вводимо позначення
// вік користувача по факту
// граничний вік

// // крок 1  Ввести данні
// let userAge = parseInt(prompt('Скільки вам років?'))

// const edgeAge = 17
// //крок 2 розв'язок задачі
// if (userAge < edgeAge) {
//   if (confirm('Чи хочеш ти морозива?')) {
//     alert(`тримай своє морозиво!`)
//   }
//   else
//     alert('то нюхай бебру')
// }
// // if (userAge >= edgeAge)
// else {
//   if (confirm('Чи хочеш ти пива?')) {
//     alert(`тримай своє пиво!`)
//   }
//   else
//     alert('то нюхай бебру')
// }



//! 02: 08: 00 Тернарний оператор

// let a = 2, b = 20
// if (a > b)
//   alert(a)
// else
//   alert(b)


// let max = a > b ? a : b

// alert(max)





//! Задача5
// крок 0 вводимо позначення
// вводиться кількість балів
// вивести оцінку у відповідності:
// задовільно 3
// добре 4
// відмінно 5

// //крок 1  Ввести данні
// let rating = parseInt(prompt('Яка кількість балів по 5-бальній шкалі? '))
// let result

// //крок 2 розв'язок задачі
// // if (rating === 5)
// //   alert('відмінно')
// // else if (rating === 4)
// //   alert('добре')
// // else if (rating === 3)
// //   alert('задовільно')
// // else if (rating === 2 || rating === 1)
// //   alert('не задовільно')
// // else
// //   alert('невірне значення')

// //крок 2 розв'язок задачі за допомогою switch
// switch (rating) {
//   case 1:
//   case 2: result = "не задовільно"
//     break;
//   case 3: result = "задовільно"
//     break;
//   case 4: result = "добре"
//     break;
//   case 5: result = "відмінно"
//     break;
//   default: result = "невірне значення"
//     break;
// }
// alert(result)


//   // case 2 - умова  : result = "не задовільно" - що виводимо при цій умові


//! 	02:30:00 Задача6
// // крок 0 вводимо позначення
// // вводиться місце
// // 1 Золота медаль
// // 2 Срібна медаль
// // 3 Бронзова медаль
// // інше - Грамота

// //крок 1  Ввести данні
// let placeNum = parseInt(prompt('Яке місце посів спортсмен? '))
// let result
// //крок 2 розв'язок задачі
// switch (placeNum) {
//   case 1: result = "Золота медаль"
//     break;
//   case 2: result = "Срібна медаль"
//     break;
//   case 3: result = "Бронзова медаль"
//     break;
//   default: result = "Грамота"
//     break;
// }
// alert(result)


//! 02:43:00  Задача7
// крок 0 вводимо позначення
// вводиться Колір
// red спілий помідор
// yellow майже спілий
// green ще дозріває

//крок 1  Ввести данні
// let tomatColor = prompt('Колір помідора? ')
// let color
// //крок 2 розв'язок задачі
// switch (tomatColor) {
//   case "red": color = "спілий помідор"
//     break;
//   case "yellow": color = "майже спілий"
//     break;
//   case "green": color = "ще дозріває"
//     break;
//   default: color = "не вірне значення"
//     break;
// }
// alert(color)